
++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb'!
           XSB uses this directory to store data.

++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb/config'!
           XSB uses this directory to store data.

++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb/config/x86_64-unknown-linux-gnu'!
           XSB uses this directory to store data.
[xsb_configuration loaded]
[sysinitrc loaded]
[xsbbrat loaded]

XSB Version 4.0.0 (TaB) of April 1, 2021
[x86_64-unknown-linux-gnu 64 bits; mode: optimal; engine: slg-wam; scheduling: local]
[Build date: 2022-11-22]

| ?- [Compiling /home/mulval/lib/libmulval]
++Warning[XSB]: [Compiler] /home/mulval/lib/libmulval : Singleton variable Fact in a clause of output_metric/1
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/mulval/lib/libmulval.xwam.6519b47f936e-351]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- [Compiling /home/mulval/src/analyzer/auxiliary]
++Warning[XSB]: [Compiler] /home/mulval/src/analyzer/auxiliary : Singleton variable Fact in a clause of cost/2
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/mulval/src/analyzer/auxiliary.xwam.6519b47f936e-351]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- [Compiling /home/mulval/src/adapter/vul_summary]
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/mulval/src/adapter/vul_summary.xwam.6519b47f936e-351]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- [/var/www/html/scriptphp/nessus.P dynamically loaded, cpu time used: 0.004 seconds]

yes
| ?- 
yes
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : summarize_vuln / 1 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : networkServiceInfo / 5 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:call_c/1  From /home/XSB/syslib/standard.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : list_apply / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : list_apply / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : list_apply / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : list_apply / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : list_apply / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- 
yes
| ?- 
End XSB (cputime 0.21 secs, elapsetime 2.44 secs)
