
++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb'!
           XSB uses this directory to store data.

++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb/config'!
           XSB uses this directory to store data.

++Warning[XSB]: [Runtime/C] Cannot create directory `/home/XSB/.xsb/config/x86_64-unknown-linux-gnu'!
           XSB uses this directory to store data.
[xsb_configuration loaded]
[sysinitrc loaded]
[xsbbrat loaded, cpu time used: 0.001 seconds]

XSB Version 4.0.0 (TaB) of April 1, 2021
[x86_64-unknown-linux-gnu 64 bits; mode: optimal; engine: slg-wam; scheduling: local]
[Build date: 2022-11-22]

| ?- [Compiling ./results]
[results compiled, cpu time used: 0.041 seconds]
[results loaded]

yes
| ?- [Compiling /home/mulval/lib/libmulval]
++Warning[XSB]: [Compiler] /home/mulval/lib/libmulval : Singleton variable Fact in a clause of output_metric/1
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/mulval/lib/libmulval.xwam.6519b47f936e-299]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- [Compiling /home/mulval/src/adapter/nessus_translator]
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable ResRemoval in a clause of hasIntegEffect/1
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable IndirDisclosure in a clause of hasConfEffect/1
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable WritePerm in a clause of hasIntegEffect/1
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable ReadPerm in a clause of hasConfEffect/1
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable ServInterrupt in a clause of hasAvailEffect/1
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Port in a clause of vulExists/3
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Prot in a clause of vulExists/3
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Host in a clause of cvss/2
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Prog in a clause of cvss/2
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable RangeList in a clause of cvss/2
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Losstype in a clause of cvss/2
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Port in a clause of cvss/2
++Warning[XSB]: [Compiler] /home/mulval/src/adapter/nessus_translator : Singleton variable Prot in a clause of cvss/2
% Specialising partially instantiated calls to vulProperty/5
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/mulval/src/adapter/nessus_translator.xwam.6519b47f936e-299]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- [Compiling /home/XSB/syslib/machine]
[gpp: Preprocessing /home/XSB/syslib/machine.P]
++Error[XSB/Runtime/P]: [Permission (Operation) open[mode=w,errno= EACCES: Permission denied] on file: /home/XSB/syslib/machine.xwam.6519b47f936e-299]  in open/3
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:open/3  From /home/XSB/syslib/standard.xwam
... compile:compile1/9  From /home/XSB/cmplib/compile.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... consult:compile_f/7  From /home/XSB/syslib/consult.xwam
... consult:reconsult0/3  From /home/XSB/syslib/consult.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- 
yes
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : vulProperty / 3 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:call_c/1  From /home/XSB/syslib/standard.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : vulExists / 3 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:call_c/1  From /home/XSB/syslib/standard.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : cvss / 2 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:call_c/1  From /home/XSB/syslib/standard.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- ++Error[XSB/Runtime/P]: [Existence (No predicate usermod : networkServiceInfo / 5 exists)] []
Forward Continuation...
... machine:xsb_backtrace/1  From /home/XSB/syslib/machine.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:call_c/1  From /home/XSB/syslib/standard.xwam
... x_interp:_$call/1  From /home/XSB/syslib/x_interp.xwam
... x_interp:call_query/1  From /home/XSB/syslib/x_interp.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
... x_interp:interpreter/0  From /home/XSB/syslib/x_interp.xwam
... loader:ll_code_call/3  From /home/XSB/syslib/loader.xwam
... loader:find_ofile_and_load/5  From /home/XSB/syslib/loader.xwam
... standard:call/1  From /home/XSB/syslib/standard.xwam
... standard:catch/3  From /home/XSB/syslib/standard.xwam
| ?- 
yes
| ?- 
End XSB (cputime 0.36 secs, elapsetime 2.01 secs)
